  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/add-nat-gw` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/f9f4bd1f-65ec-4de8-85a6-c23729203c08/terraform-bin plan -no-color -compact-warnings

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

# module.vnet.module.firewall.azurerm_firewall.firewall has been deleted
- resource "azurerm_firewall" "firewall" {
    - id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/azureFirewalls/my-secure-firewall" -> null
      name                = "my-secure-firewall"
      tags                = {}
      # (8 unchanged attributes hidden)

    ~ ip_configuration {
          name                 = "my-secure-firewall-ip-config"
        - private_ip_address   = "10.0.0.4" -> null
          # (2 unchanged attributes hidden)
      }
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway has been deleted
- resource "azurerm_nat_gateway" "nat_gateway" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/natGateways/my-secure-nat-gw" -> null
      name                    = "my-secure-nat-gw"
      # (5 unchanged attributes hidden)
  }

# module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1" -> null
    - ip_address              = "20.163.249.64" -> null
      name                    = "my-secure-nat-gw-public-ip-1"
      tags                    = {}
      # (9 unchanged attributes hidden)
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_subnet_route_table_association.server_subnet_association will be created
+ resource "azurerm_subnet_route_table_association" "server_subnet_association" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.server_subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.1.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "ServerSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.azurerm_subnet_nat_gateway_association.firewall_association will be created
+ resource "azurerm_subnet_nat_gateway_association" "firewall_association" {
    + id             = (known after apply)
    + nat_gateway_id = (known after apply)
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet"
  }

# module.vnet.module.firewall.azurerm_firewall.firewall will be created
+ resource "azurerm_firewall" "firewall" {
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-firewall"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku_name            = "AZFW_VNet"
    + sku_tier            = "Standard"
    + threat_intel_mode   = (known after apply)

    + ip_configuration {
        + name                 = "my-secure-firewall-ip-config"
        + private_ip_address   = (known after apply)
        + public_ip_address_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-firewall-ip"
        + subnet_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet"
      }
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway will be created
+ resource "azurerm_nat_gateway" "nat_gateway" {
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + location                = "eastus"
    + name                    = "my-secure-nat-gw"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + resource_guid           = (known after apply)
    + sku_name                = "Standard"
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"] will be created
+ resource "azurerm_nat_gateway_public_ip_association" "association" {
    + id                   = (known after apply)
    + nat_gateway_id       = (known after apply)
    + public_ip_address_id = (known after apply)
  }

# module.vnet.module.route_table.azurerm_route_table.route_table will be created
+ resource "azurerm_route_table" "route_table" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "eastus"
    + name                          = "my-secure-route-table"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "0.0.0.0"
            + name                   = "ToFirewall"
            + next_hop_in_ip_address = (known after apply)
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "VnetRoute"
            + next_hop_in_ip_address = ""
            + next_hop_type          = "VnetLocal"
          },
      ]
    + subnets                       = (known after apply)
  }

# module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-nat-gw-public-ip-1"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>